{"data":{"contentfulBlogPost":{"id":"08992ee1-64d7-599d-8a65-ed8546ab7db8","postTitle":"Quick thoughts on Airbnb sunsetting React Native","postContent":{"childMarkdownRemark":{"html":"<p>Last week, Airbnb released a <a href=\"https://medium.com/airbnb-engineering/react-native-at-airbnb-f95aa460be1c\" title=\"Airbnb blog\">series of blog posts</a> detailing their experiences with React Native that ultimately led to their decision to sunset their development of native applications with it.</p>\n<p>The moment it went live, the developer communities around iOS, Android and Javascript lit up with <a href=\"https://ashfurrow.com/blog/airbnb-and-react-native-expectations/\" title=\"Ash Furrow Blog\">commentaries</a> <a href=\"https://blog.expo.io/should-we-use-react-native-1465d8b607ac\" title=\"Expo\">coming</a> <a href=\"http://headway.io/blog/react-native-is-getting-evicted-by-airbnb-our-response/\" title=\"Headway\">from</a> <a href=\"https://www.reddit.com/r/programming/comments/8saw35/airbnb_moving_away_from_react_native/\" title=\"Reddit\">every</a> <a href=\"https://twitter.com/sophiebits/status/1009470610370543616\" title=\"Sophie Bits\">direction</a>.</p>\n<p>I'm not going to even attempt to delve into who is right or wrong in this scenario. There's a fair amount of posturing going on right now and quite candidly, I don't know if my opinions are well formed enough on the matter to lean one way over the other. I do have some thoughts on the matter though:</p>\n<h2>Give credit where credit's due</h2>\n<p>The fact that Airbnb felt comfortable enough putting all of that information out there, fully knowing what sort of \"firestorm\" it'd create has to recognized. It's an age old habit of programmers to argue implementation philosphy and that's never going to change. I know I've run into various scenarios where I just kept my mouth shut instead of having to argue the same points over and over regarding a technological decision. It gets tiring.</p>\n<p>Airbnb could have simply made the change internally and moved on with its business, but felt the need to keep the community involved. They knew what they'd recieved throghout the years from the open source community meant they owed everyone else transparency when it came to this decision.</p>\n<h2>Cross-platform development isn't new</h2>\n<p>React Native is not the first attempt at a solution to the developer holy grail of \"code once, deploy on many platforms\". It just so happens to be one of the latest (but no longer the newest) that also has a huge ecosystem of burgeoning developers to feed into its interest and continued development. It helps that it has one of the largest technology companies in the world backing most of its development.</p>\n<p>Investing in a newer platform as the future of your business means you have to be <strong>extra</strong> sure it'll work for you in the long run. Of course there are apps out there built (and being built) with Rubymotion, Phonegap, Cordova, Xamarin, etc. There's nothing inherently wrong with that, but once you go down that route, you are basically stuck there and moving away means starting over.</p>\n<h2>A net positive</h2>\n<p>Eating the cost of having to sunset a technology is never easy, but I think it's fair to say Airbnb's engineering platforms and teams have grown because of the work that they've put into making React Native work.</p>\n<p>Working in newer tech means you really have to own a lot more of the entire process: bug reporting, enhancement and roadmap requests and just general splelunking through the source code when things <strong>just don't work</strong>. In the end, the engineers who had to work on all of that are better off because of it.</p>\n<p>Would they have had the same experiences and growth had they not gone that route? Probably, as Swift has really progressed even further over the past two years, especially after having gone open source. But, it's near impossible to know how much.</p>\n<hr>\n<p>I'm really happy Airbnb wrote out all of that information and more people are talking about it. They're the right conversations to be having as native development continues to mature.</p>"}},"datePosted":"2018-06-26","author":{"name":"Bay Phillips"},"postSlug":"thoughts-airbnb-sunsetting-react-native","contentPreview":{"childMarkdownRemark":{"html":"<p>Airbnb is no longer using React Native for its applications and everyone has an opinion on their decision.</p>","excerpt":"Airbnb is no longer using React Native for its applications and everyone has an opinion on their decision."}},"headerImage":{"fluid":{"src":"//images.ctfassets.net/sk06mmp11skx/4RzID0fKGcMWiMauSomcgG/03d748bbbfbd21f294e071dac263832c/sunsetjpg.jpg?w=900&q=50"}},"metaContent":{"keywords":["React Native","Airbnb","Sunset","Swift","Kotlin","iOS","Android","App"]}}},"pageContext":{"jsonName":"blog-thoughts-airbnb-sunsetting-react-native-326","internalComponentName":"ComponentBlogThoughtsAirbnbSunsettingReactNative","path":"/blog/thoughts-airbnb-sunsetting-react-native/","component":"/home/circleci/workspace/src/templates/blogPost.js","componentChunkName":"component---src-templates-blog-post-js","context":{"postSlug":"thoughts-airbnb-sunsetting-react-native"},"updatedAt":1531075706726,"pluginCreator___NODE":"Plugin default-site-plugin","pluginCreatorId":"Plugin default-site-plugin","componentPath":"/home/circleci/workspace/src/templates/blogPost.js","postSlug":"thoughts-airbnb-sunsetting-react-native"}}