{"data":{"contentfulBlogPost":{"id":"3aa3be14-3c24-5bc9-9953-aa4e3340c2ed","postTitle":"The move to GatsbyJS - Part 1","postContent":{"childMarkdownRemark":{"html":"<p>This is the first of many in a series in which I'd like to walk through how I moved off of my WordPress blog to a staticly generated website powered by <a href=\"https://www.gatsbyjs.org/\" title=\"Gatsby JS\">GatsbyJS</a>. To start though, I'd like to give a brief overview of why I'm doing it and how it was done.</p>\n<h2>The requirements</h2>\n<p>I had several things I wanted to accomplish in this move:</p>\n<ol>\n<li>Stop having to worry about keeping a WordPress installation up to date and secure.</li>\n<li>Cut down on my webhosting costs. I could lessen them with my current website, but I wanted to do better.</li>\n<li>Have a really fast website because I'm older and remember when websites were \"better\".</li>\n<li>Learn React and GraphQL. I manage teams of software engineers now and I should be more knowledgable about modern technologies if I'm to be in any way effective at my job.</li>\n</ol>\n<p>With those requirements laid out, I quickly started putting all of the pieces together.</p>\n<h2>Hosting on Github</h2>\n<p>Staticly generated websites mean they compile down to HTML, CSS and Javascript so I don't need a webserver providing dynamic content anymore. I already pay for a basic GitHub account, and my code for this website was going to live there anyways, so why not leverage Github Pages?</p>\n<h2>GatsbyJS and React</h2>\n<p>For the past several years, I've primarily stuck to native application development, mostly Swift and a bit of Java, while also building out web applications primarily for their APIs. This meant my webdev skillset has been outdated overtime and React has taken over most of the modern tooling when it comes to building clients on the web. I figured it'd be a natural way for me to start figuring out what all the hubub is actually about and it really is quite nice.</p>\n<h2>UIKit</h2>\n<p>I also wanted an excuse to play around with a more modern CSS framework (one we too are also starting to use at Plated) to make my website lightweight while also responsive. It was fortunate that <a href=\"https://getuikit.com/\" title=\"UIKit\">UIKit</a> is currently beta-ing their v3 of their framework and it works great! That, paired with SASS, and I'm able to create my own theme on top of UIKit. I'm not too sure how I feel about <code class=\"language-text\">styled-components</code> just yet, but that'll probably be the next place I start delving deeper into.</p>\n<h2>Contentful as a free CMS</h2>\n<p>I merely found out about <a href=\"https://www.contentful.com\" title=\"Contentful\">Contentful</a> when browsing through various Gatsby starters. I simply signed up for a free acount, not really knowing what I was doing, and it clicked really quickly for me. I could \"recreate\" the fundamental models provided by WordPress and reuse it for this blog. It also really helped the <a href=\"https://github.com/gatsbyjs/gatsby/tree/master/packages/gatsby-source-contentful\" title=\"Gatsby Contentful Source Plugin\">gatsby-source-contentful</a> works really, really, well.</p>\n<h2>Deploying</h2>\n<p>We've used <a href=\"https://www.circleci.com\">CircleCI</a> over at <a href=\"https://www.plated.com\" title=\"Plated\">Plated</a> for the past 3+ years, so I was already really familiar with how to set it up. I figured I could leverage its build and deployment jobs to make things more \"automatic\". It's also free for personal projects, so I mean, why not?</p>\n<h2>Putting it all together</h2>\n<p>I think I've gotten the build to deployment process down pat now. It looks like this:</p>\n<ul>\n<li>I create my blog posts in my Contentful account with their respective properties (title, header image, slug, text and preview) and hit save/publish.</li>\n<li>I run <code class=\"language-text\">yarn dev</code> locally in my Gatsby application.</li>\n<li>The Gatsby Contentful plugin pulls down any new content from Contenful that my local machine hasn't seen yet and throws it into GraphQL.</li>\n<li>Gatsby builds all of that content for development into my specified templates (blog posts, pages) and I'm ready to work.</li>\n<li>When I feel good with whatever feature I'm building out, I push up my commits and open a PR in my Github repository to then be merged back into my <code class=\"language-text\">master</code> branch.</li>\n<li>When new commits are found in <code class=\"language-text\">master</code>, CircleCI recognizes the changes, runs <code class=\"language-text\">yarn generate</code>, which compiles the entire website for production, copies it into a <code class=\"language-text\">docs</code> folder (for Github Pages), and commits it into <code class=\"language-text\">master</code> and pushes it back into the repository.</li>\n<li>About one minute later after the Github Page's cache resets, my changes are now live on my website.</li>\n<li>If I'm just adding or editing new content in Contentful and I don't want to have to push changes up via Git, I've created a <a href=\"https://www.contentful.com/developers/docs/concepts/webhooks/\" title=\"Contentful Webhook\">webhook in Contentful</a> that triggers rebuilds on CircleCI every time new content is published via the CMS.</li>\n</ul>\n<p>There's a lot of detail I've left out in these steps, but I'm excited to keep working on this site and flushing everything else further.</p>\n<p>I've made the repository running this website public. Please feel free to <a href=\"https://github.com/BayPhillips/gatsby-blog\" title=\"Code repository\">check it out</a>.</p>"}},"datePosted":"2018-06-23","author":{"name":"Bay Phillips"},"postSlug":"the-move-to-gatsbyjs","contentPreview":{"childMarkdownRemark":{"html":"<p>Why did I feel the need to move off of WordPress and how am I doing it?</p>"}}}},"pageContext":{"jsonName":"blog-the-move-to-gatsbyjs-604","internalComponentName":"ComponentBlogTheMoveToGatsbyjs","path":"/blog/the-move-to-gatsbyjs/","component":"/home/circleci/workspace/src/templates/blogPost.js","componentChunkName":"component---src-templates-blog-post-js","context":{"postSlug":"the-move-to-gatsbyjs"},"updatedAt":1530848051933,"pluginCreator___NODE":"Plugin default-site-plugin","pluginCreatorId":"Plugin default-site-plugin","componentPath":"/home/circleci/workspace/src/templates/blogPost.js","postSlug":"the-move-to-gatsbyjs"}}