{"data":{"contentfulBlogPost":{"id":"3aa3be14-3c24-5bc9-9953-aa4e3340c2ed","postTitle":"The move to GatsbyJS - Part 1","postContent":{"childMarkdownRemark":{"html":"<p>This is the first of many in a series in which I'd like to walk through how I moved off of my WordPress blog to a staticly generated website powered by <a href=\"https://www.gatsbyjs.org/\" title=\"Gatsby JS\">GatsbyJS</a>. To start though, I'd like to give a brief overview of how it was done.</p>\n<h2>The requirements</h2>\n<p>I had several things I wanted to accomplish in this move:</p>\n<ol>\n<li>Stop having to worry about keeping a WordPress installation up to date and secure.</li>\n<li>Cut down on my webhosting costs. I could lessen them with my current website, but I wanted to do better.</li>\n<li>Have a really fast website because I'm older and remember when websites were \"simpler\"</li>\n<li>Learn React and GraphQL. I manage teams of software engineers now and I should be more knowledgable about modern technologies if I'm to be in any way effective at my job.</li>\n</ol>\n<p>With those requirements laid out, I quickly started putting all of the pieces together.</p>\n<h2>Hosting on Github</h2>\n<p>Staticly generated websites mean they compile down to HTML, CSS and Javascript so I don't need a webserver providing dynamic content anymore. I already pay for a basic GitHub account, and my code for this website was going to live there anyways, so why not leverage Github Pages?</p>\n<h2>Deploying</h2>\n<p>When we merge into master, we build and deploy. When we create or update on Contentful, we hook into those existing processing and build.</p>\n<p>Hopefully this also reset master back to where it needed to be.</p>"}},"datePosted":"2018-06-23","author":{"name":"Bay Phillips"},"postSlug":"the-move-to-gatsbyjs","contentPreview":{"childMarkdownRemark":{"html":"<p>How can we make websites faster with a lot less overhead. Oh also, make it completely free to run.</p>"}}}},"pageContext":{"jsonName":"blog-the-move-to-gatsbyjs-604","internalComponentName":"ComponentBlogTheMoveToGatsbyjs","path":"/blog/the-move-to-gatsbyjs/","component":"/home/circleci/workspace/src/templates/blogPost.js","componentChunkName":"component---src-templates-blog-post-js","context":{"postSlug":"the-move-to-gatsbyjs"},"updatedAt":1529808571066,"pluginCreator___NODE":"Plugin default-site-plugin","pluginCreatorId":"Plugin default-site-plugin","componentPath":"/home/circleci/workspace/src/templates/blogPost.js","postSlug":"the-move-to-gatsbyjs"}}